2023-01/smartsim/mesh-motion/spinningBlock_tet/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    BLOCK
    {
        type              movingWallVelocity;
        value             uniform (0 0 0);
        //type            rotatingWallVelocity;
        //origin          (0 0 0);
        //axis            (0 0 1);
        //omega           2;
    }

    "(TOP|BOTTOM)"
    {
        type            noSlip;
    }

    "(FRONT|BACK)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
