2023-01/smartsim/mesh-motion/spinningBlock_tet/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET
    {
        type            fixedValue;
        value           $internalField;
    }

    BLOCK
    {
        type        solidBodyMotionDisplacement;
        solidBodyMotionFunction  multiMotion;
            multiMotionCoeffs
            {
                translation
                {
                        solidBodyMotionFunction  linearMotion;
                        linearMotionCoeffs
                        {
                            velocity   (0.05 0.05 0);
                        }
                }
                rotation
                {
                    solidBodyMotionFunction rotatingMotion;
                    rotatingMotionCoeffs
                    {
                        origin      (0 0 0);
                        axis        (0 0 1);
                        omega       0.1; // rad/s, 1rad/s=9.5rpm
                    }
                }
            }
        //solidBodyMotionFunction  oscillatingRotatingMotion;
        //oscillatingRotatingMotionCoeffs
        //{
        //   origin      (0 0 0);
        //   axis        (0 0 1);
        //   omega       2;          // rad/s, 1rad/s=9.5rpm
        //   amplitude   (0 0 20);    // max amplitude (degrees)
        //}
    }

    "(TOP|BOTTOM)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(FRONT|BACK)"
    {
        type            zeroGradient;
        value           $internalField;
    }

}


// ************************************************************************* //
